### Terraform Plan (envs/dev)
```
module.s3.aws_s3_bucket_versioning.logs: Refreshing state... [id=moksim-terraform-poc-logs-001]
module.s3.aws_s3_bucket_public_access_block.logs: Refreshing state... [id=moksim-terraform-poc-logs-001]
module.s3.aws_s3_bucket.app: Refreshing state... [id=moksim-terraform-poc-app-001]
module.s3.aws_s3_bucket_lifecycle_configuration.logs: Refreshing state... [id=moksim-terraform-poc-logs-001]
module.s3.aws_s3_bucket_server_side_encryption_configuration.logs: Refreshing state... [id=moksim-terraform-poc-logs-001]
module.iam.data.aws_iam_policy_document.assume_role_ec2: Reading...
module.s3.aws_s3_bucket.logs: Refreshing state... [id=moksim-terraform-poc-logs-001]
module.s3.aws_s3_bucket_public_access_block.app: Refreshing state... [id=moksim-terraform-poc-app-001]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-019b79dbe77577d1f]
module.iam.data.aws_iam_policy_document.assume_role_ec2: Read complete after 0s [id=2851119427]
module.iam.aws_iam_role.ec2_role: Refreshing state... [id=dev-ec2-role]
module.iam.aws_iam_instance_profile.ec2_profile: Refreshing state... [id=dev-ec2-profile]
module.vpc.aws_internet_gateway.igw: Refreshing state... [id=igw-00703b8b8db4adec7]
module.vpc.aws_subnet.public: Refreshing state... [id=subnet-0df2b43b3fe963b28]
module.vpc.aws_subnet.private: Refreshing state... [id=subnet-03d686b642c045ad1]
module.ec2.aws_security_group.sg: Refreshing state... [id=sg-0c7d754b36b0ac866]
module.vpc.aws_route_table.public_rt: Refreshing state... [id=rtb-0391f10d2d19dff29]
module.s3.aws_s3_bucket_server_side_encryption_configuration.app: Refreshing state... [id=moksim-terraform-poc-app-001]
module.s3.aws_s3_bucket_versioning.app: Refreshing state... [id=moksim-terraform-poc-app-001]
module.iam.data.aws_iam_policy_document.s3_logs_write: Reading...
module.iam.data.aws_iam_policy_document.s3_logs_write: Read complete after 0s [id=4082723639]
module.iam.aws_iam_policy.ec2_s3_logs_policy: Refreshing state... [id=arn:aws:iam::545892166941:policy/dev-ec2-role-s3-logs]
module.vpc.aws_route_table_association.public_assoc: Refreshing state... [id=rtbassoc-0dda533d578af3431]
module.ec2.aws_instance.vm: Refreshing state... [id=i-0def51871ea39b6b1]
module.iam.aws_iam_role_policy_attachment.attach_logs_policy: Refreshing state... [id=dev-ec2-role/arn:aws:iam::545892166941:policy/dev-ec2-role-s3-logs]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ec2.aws_instance.vm must be replaced
-/+ resource "aws_instance" "vm" {
      ~ arn                                  = "arn:aws:ec2:eu-west-1:545892166941:instance/i-0def51871ea39b6b1" -> (known after apply)
      ~ availability_zone                    = "eu-west-1c" -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-0def51871ea39b6b1" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_group_id                   = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0c56139031ef7e254" -> (known after apply)
      ~ private_dns                          = "ip-10-10-1-243.eu-west-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.10.1.243" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "3.255.75.83" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Name" = "dev-instance"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = <<-EOT # forces replacement
            #!/bin/bash
            set -euo pipefail
            
            LOG_FILE="/var/log/poc-bootstrap.log"
            exec > >(tee -a "${LOG_FILE}") 2>&1
            
            echo "Bootstrap started at $(date -Is)"
            
            # Detect OS and install awscli + curl
            if command -v apt-get >/dev/null 2>&1; then
              apt-get update -y
              apt-get install -y awscli curl
            elif command -v yum >/dev/null 2>&1; then
              yum update -y
              yum install -y awscli curl
            else
              echo "Unsupported package manager"
              exit 1
            fi
            
            echo "awscli version: $(aws --version 2>&1)"
            
            # Create a simple PoC marker file
            echo "Terraform PoC instance ready at $(date -Is)" > /opt/poc.txt
            
            # Upload bootstrap log to S3 logs bucket (proves IAM instance profile works)
            aws s3 cp "${LOG_FILE}" "s3://moksim-terraform-poc-logs-001/bootstrap/$(hostname)-bootstrap.log"
            
            echo "Bootstrap completed at $(date -Is)"
        EOT
      + user_data_base64                     = (known after apply)
      ~ user_data_replace_on_change          = false -> true
        # (12 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      ~ network_interface (known after apply)

      ~ primary_network_interface (known after apply)
      - primary_network_interface {
          - delete_on_termination = true -> null
          - network_interface_id  = "eni-0c56139031ef7e254" -> null
        }

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device (known after apply)
      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0d89850254ee7aa88" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
            # (1 unchanged attribute hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ public_ip = "3.255.75.83" -> (known after apply)
  - ssh       = "ssh -i maksim-dev-key ubuntu@3.255.75.83" -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```